OpenFOAM/foam9tutorials/CFD/naturalConvection/constant/LESProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      LESProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

LESModel        Smagorinsky;

delta           cubeRootVol;

turbulence      on;

printCoeffs     on;

SmagorinskyCoeffs
{
    ck          0.05;
    ce          1.0;
    Prt         0.5;
}

cubeRootVolCoeffs
{
    deltaCoeff      1;
}

// ************************************************************************* //
